Show installed services where the name is not mgmt_service (can be done with 7045 or 4697)
index=main LogName=System EventCode=7045 NOT (Service_Name=mgmt_service OR Service_Type="*Kernel*") AND (Service_Start_Type="*demand*") | eval Message=split(Message,".")  | eval Short_Message=mvindex(Message,0)  | eval Service_File_Name=substr(Service_File_Name,1,100)."..."  | table _time host Service_Name,Service_Type, Service_Start_Type, Service_Account, Short_Message, Service_File_Name

index=main earliest=-7d EventCode=4697 NOT (Service_File_Name="C:\\Windows\\*" OR Service_File_Name="\\SystemRoot\\*" OR Service_File_Name="*C:\\Program Files*\\*") AND (Account_Name != "*$*") | eval Service_File_Name=substr(Service_File_Name,1,100)."..."  | table _time, ComputerName, Account_Name, Service_Name, Service_File_Name, Service_Start_Type
